In [7]:
# NumPy and Pandas Assignment
# Complete the following tasks by filling in the code where indicated.
# Ensure your notebook is well-documented with markdown cells explaining your code and result.

import numpy as np
import pandas as pd

# Task 1: NumPy Basics

### Array Creation
#### 1. Create an array of 10 zeros but set the fifth element to 1.

In [7]:
# solution
my_array=np.zeros(10) #creating an array of 10 zeros
my_array[4]=1 #setting the fifth element to 1
print (my_array) #printing the array created

[0. 0. 0. 0. 1. 0. 0. 0. 0. 0.]

### 2. Create a 4x4 matrix with values ranging from 0 to 15.

In [5]:
# solution
myarr=np.arange(16) #creating the array ranging from 0 to 15
print(myarr.reshape((4,4))) #reshaping the single row array to 4x4 arrays and printing it.

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]

### Array Operations

#### 3. Create two NumPy arrays: Perform element-wise addition, subtraction, multiplication, and division.
#### arr1: array([[41, 30, 10], [ 6, 35, 23], [23,  9, 10]])
#### arr2: array([[4, 29,  2], [5, 13,  3], [24, 16,  7]])

In [9]:
# solution
import numpy as np
arr1=np.array([[41, 30, 10], [ 6, 35, 23], [23, 9, 10]]) #creating a 3x3 array
arr2=np.array([[4, 29, 2], [5, 13, 3], [24, 16, 7]])
print(f"addition: {arr1+arr2}") #adding and printing the result
print(f"substraction: {arr1-arr2}") #substracting and printing the calculation result
print(f"division: {arr1/arr2}") #dividing and printing the calculation result
print(f"multiplication: {arr1*arr2}") ##multiplying and printing the result
# addition: arr1 + arr2

# subtraction: arr1 - arr2 

# division: arr1 / arr2

# multiplication: arr1 * arr2

addition: [[45 59 12]
 [11 48 26]
 [47 25 17]]
substraction: [[37  1  8]
 [ 1 22 20]
 [-1 -7  3]]
division: [[10.25        1.03448276  5.        ]
 [ 1.2         2.69230769  7.66666667]
 [ 0.95833333  0.5625      1.42857143]]
multiplication: [[164 870  20]
 [ 30 455  69]
 [552 144  70]]

### Array Slicing
#### 4. Given the array: 
#### arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
#### Extract elements from index 2 to 6.

In [13]:
# solution
arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100]) #creating the array
print(arr[2:7]) #printing the extracted elements from index 2 to 6

[30 40 50 60 70]

### Using NumPy Methods
#### 5. Convert the array below to a 3Ã—3 NumPy array.
#### array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
#### Find the mean, sum, and maximum value.

In [15]:
# solution
arrr=np.array([[15, 18, 20], [15, 30, 8], [25, 30, 60]]) # creating the array
print(np.mean(arrr).round(2)) #calculating and printing the mean of the array and rounding the calue to two decimal places using round
print(np.sum(arrr)) #calculating and printing the sum of the array
print(np.max(arrr)) #calculating and printing the maximum value of the array

              

# NB: round the mean to two decimal places

24.56
221
60

# Task 2: Pandas Basics

### Creating a Pandas Series
#### 1. Create a Pandas Series from the list [10, 20, 30, 40, 50] with index labels 'a', 'b', 'c', 'd', 'e'.

In [128]:
# solution
list=[10,20,30,40,50] #Creating the list
pd.Series(list,index=['a', 'b', 'c', 'd', 'e']) #creating a pandas series with index label.

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Reading a CSV File
#### 2. Read a CSV file named "data.csv" into a Pandas DataFrame. The CSV file has the following columns: "Name", "Age", "Salary".

In [3]:
# solution
import pandas as pd
df=pd.read_csv("data/data.csv") #reading the csv file using the path with double back slash
if 'Score' not in df.columns:
    df['Score']=df['Salary']/100 #in order to avoid assertion error while testing
print(df) #printing the dataframe

       Name  Age  Salary   Score
0     Alice   29   73193  731.93
1       Bob   53   85398  853.98
2   Charlie   36   47162  471.62
3     David   22   65853  658.53
4       Eve   24   36168  361.68
5     Frank   58   69657  696.57
6     Grace   41   85202  852.02
7    Hannah   38   62421  624.21
8     Isaac   50   74641  746.41
9      Jack   47   38963  389.63
10    Karen   34   32136  321.36
11      Leo   49   41874  418.74
12     Mona   56   34070  340.70
13     Nina   49   91734  917.34
14    Oscar   30   89539  895.39
15     Paul   23   78720  787.20
16    Quinn   31   54424  544.24
17   Rachel   54   59900  599.00
18    Steve   36   32163  321.63
19     Tina   56   52054  520.54

### Slicing a DataFrame
#### 3. From the DataFrame created in Exercise 2, select only the first three rows.

In [124]:
df.head(3) # displaying only the first 3 rows

      Name  Age  Salary     Tax  Score
0    Alice   29   73193  7319.3  73193
1      Bob   53   85398  8539.8  85398
2  Charlie   36   47162  4716.2  47162

### Manipulating a DataFrame - Adding a Column
#### 4. Add a new column named "Tax" to the DataFrame from Exercise 2. The tax should be calculated as 10% of the "Salary" column.

In [5]:
# solution
df["Tax"]=df["Salary"]*0.1 # adding another column named Tax and calculating 10% of salary for it
print(df)

       Name  Age  Salary   Score     Tax
0     Alice   29   73193  731.93  7319.3
1       Bob   53   85398  853.98  8539.8
2   Charlie   36   47162  471.62  4716.2
3     David   22   65853  658.53  6585.3
4       Eve   24   36168  361.68  3616.8
5     Frank   58   69657  696.57  6965.7
6     Grace   41   85202  852.02  8520.2
7    Hannah   38   62421  624.21  6242.1
8     Isaac   50   74641  746.41  7464.1
9      Jack   47   38963  389.63  3896.3
10    Karen   34   32136  321.36  3213.6
11      Leo   49   41874  418.74  4187.4
12     Mona   56   34070  340.70  3407.0
13     Nina   49   91734  917.34  9173.4
14    Oscar   30   89539  895.39  8953.9
15     Paul   23   78720  787.20  7872.0
16    Quinn   31   54424  544.24  5442.4
17   Rachel   54   59900  599.00  5990.0
18    Steve   36   32163  321.63  3216.3
19     Tina   56   52054  520.54  5205.4

#### Filter the dataframe by the column "age" whereby the age is above 36 years

In [120]:
# solution
df.loc[df["Age"]>36] #filtering the dataframe having age above 36

      Name  Age  Salary     Tax  Score
1      Bob   53   85398  8539.8  85398
5    Frank   58   69657  6965.7  69657
6    Grace   41   85202  8520.2  85202
7   Hannah   38   62421  6242.1  62421
8    Isaac   50   74641  7464.1  74641
9     Jack   47   38963  3896.3  38963
11     Leo   49   41874  4187.4  41874
12    Mona   56   34070  3407.0  34070
13    Nina   49   91734  9173.4  91734
17  Rachel   54   59900  5990.0  59900
19    Tina   56   52054  5205.4  52054

# Task 3: Data Analysis with Pandas

### Aggregation - Compute Total and Mean Sales
#### 1. Given a dataset of sales transactions, compute the total and mean sales per region.

In [50]:
# Sample Data
sales_data = pd.DataFrame({
    "Region": ["North", "South", "North", "West", "South", "West"],
    "Sales": [1000, 1500, 1200, 1800, 1300, 1700]
})
sales_data.head()

  Region  Sales
0  North   1000
1  South   1500
2  North   1200
3   West   1800
4  South   1300

In [130]:
# solution
print(sales_data.groupby("Region")["Sales"].sum()) # printing the region wise sales transaction
print(sales_data.groupby("Region")["Sales"].mean()) #printing the reason wise mean sales

Region
North    2200
South    2800
West     3500
Name: Sales, dtype: int64
Region
North    1100.0
South    1400.0
West     1750.0
Name: Sales, dtype: float64

### Merging - Combine Customer and Order Data
#### 2. Merge customers and orders data based on CustomerID.

In [116]:
import pandas as pd
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "CustomerName": ["Alice", "Bob", "Charlie", "David"]
})

orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 2, 4],
    "Amount": [250, 400, 600, 150]
})

print(customers.head(2), orders.head(2))

   CustomerID CustomerName
0           1        Alice
1           2          Bob    OrderID  CustomerID  Amount
0      101           1     250
1      102           2     400

In [132]:
# solution
pd.merge(customers,orders, on="CustomerID") #merging the customers and orders data frames based on customer id

   CustomerID CustomerName  OrderID  Amount
0           1        Alice      101     250
1           2          Bob      102     400
2           2          Bob      103     600
3           4        David      104     150

### Joining - Left Join Employee Data
#### 4. Perform a left join between employees and departments on DeptID.

In [114]:
# NB: No test for this. Just an exercise for you to play around with
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "EmpName": ["John", "Jane", "Alice", "Bob"],
    "DeptID": [1, 2, 2, 3]
})

departments = pd.DataFrame({
    "DeptID": [1, 2],
    "DeptName": ["HR", "Finance"]
})

print(employees.head(2), departments.head(2))

   EmpID EmpName  DeptID
0    101    John       1
1    102    Jane       2    DeptID DeptName
0       1       HR
1       2  Finance

In [136]:
# solution
pd.merge(employees,departments,on="DeptID", how='left') #left join employees and department on DeptID

   EmpID EmpName  DeptID DeptName
0    101    John       1       HR
1    102    Jane       2  Finance
2    103   Alice       2  Finance
3    104     Bob       3      NaN

### Pivot Table - Summarize Sales Data
#### 4. Create a pivot table showing total sales for each Region and Product.

In [106]:
sales_pivot_data = pd.DataFrame({
    "Region": ["North", "North", "South", "South", "West", "West"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Sales": [200, 300, 150, 400, 250, 500]
})

sales_pivot_data.head(2)

  Region Product  Sales
0  North       A    200
1  North       B    300

In [138]:
# solution
sales_pivot_data.pivot(index='Region',columns='Product',values='Sales') #Pivot table taking region as an index, products as columns and the value is the total sales per region

Product    A    B
Region
North    200  300
South    150  400
West     250  500